app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles"

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "qwerqwrq"], ["body", "qwrqwrqw"], ["published", 0], ["created_at", "2023-04-30 19:44:02.201186"], ["updated_at", "2023-04-30 19:44:02.201186"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Adriuno123"], ["updated_at", "2023-05-01 12:58:14.188042"], ["id", 4]]

  def destroy
    @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]

    def set_article
      @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]